Revit 2027 API
BuiltInFailures.SystemsFailures.ElementsBelongToOtherSystem Property
 You have selected elements that are already part of other Systems that have assigned Equipment. The elements you selected cannot be added to this System.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsBelongToOtherSystem { get; }
Public Shared ReadOnly Property ElementsBelongToOtherSystem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsBelongToOtherSystem {
	FailureDefinitionId^ get ();
}
static member ElementsBelongToOtherSystem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace